goodwhiskers/app/controllers/home_controller.rb

SELECT  "reviews".* FROM "reviews"  ORDER BY "reviews"."id" DESC LIMIT 3
SELECT "categories".* FROM "categories"
---
  def index
    @latest_three_reviews = Review.last(3)
    @product = Product.all
    @category = Category.all