goodwhiskers/app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (LOWER(name) LIKE '(%al%)' OR LOWER(description) LIKE '(%al%)')  ORDER BY created_at DESC
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "mfg", "description", "url", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "test"], ["mfg", "test1"], ["description", "test2"], ["url", "test3"], ["image", "test4"], ["created_at", "2016-03-21 20:34:04.128027"], ["updated_at", "2016-03-21 20:34:04.128027"]]
---
  def create
    @product = Product.new(product_params)
    response = Cloudinary::Uploader.upload(params["product"]["image"], :transformation => [
      {:width => 500, :height => 500, :crop => :limit},
     ],
      :eager => [
                  {:width => 75, :height => 75,
                  :crop => :thumb, :format => 'png'},
        ])
    @product.image = response["url"]
    @product.thumb = response["eager"][0]["url"]
    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = $1, "mfg" = $2, "description" = $3, "url" = $4, "updated_at" = $5 WHERE "products"."id" = $6  [["name", "OMG IMAGES2"], ["mfg", "OMG IMAGES2"], ["description", "2"], ["url", "2"], ["updated_at", "2016-03-24 16:20:44.307141"], ["id", 25]]
---
  def update
    response = Cloudinary::Uploader.upload(params["product"]["image"], :transformation => [
      {:width => 500, :height => 500, :crop => :limit},
     ],
      :eager => [
                  {:width => 75, :height => 75,
                  :crop => :thumb, :format => 'png'},
        ])
    @product.image = response["url"]
    @product.thumb = response["eager"][0]["url"]
    respond_to do |format|
      if @product.update(product_params)