goodwhiskers/app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 3]]
---
  def new
    @review = Review.new
    @product = Product.find(params[:product_id])

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "reviews" ("title", "comment", "rating", "user_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Blorch"], ["comment", "Blorch"], ["rating", 4], ["user_id", 1], ["product_id", 2], ["created_at", "2016-03-22 16:53:50.993563"], ["updated_at", "2016-03-22 16:53:50.993563"]]
---
  def create
    @review = Review.new(review_params)
    @product = Product.find(params[:product_id])
    @review.product = @product
    @review.save