goodwhiskers/app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <select name="product[category_id]">
      <% Category.all.each do |category| %>