app/controllers/products_controller.rb

  def index
      @products = Product.all
---
SELECT "products".* FROM "products" WHERE (name ILIKE '%Al%' OR description ILIKE '%Al%')  ORDER BY created_at DESC