app/views/products/_form.html.erb

    <select name="product[category_id]">
      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"